Tekla Open API Reference for Tekla Structures 2025
ModelInfo.ModelPath Property
 The path to the Tekla Structures model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ModelPath { get; set; }
Public Property ModelPath As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace